# St7GetStaticRestartFile

Returns the name of the static restart file.

long St7GetStaticRestartFile(long uID, char* FileName, long MaxStringLen)

Input Parameters

uID

Strand7 model file ID.

MaxStringLen

Maximum number of characters allocated for FileName.

Output Parameters
FileName

Full path and name for the static restart file.